tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "node"
brew "bitwarden-cli"
brew "coreutils"
brew "openssl@1.1"
brew "cask"
brew "certbot"
brew "file-formula"
brew "gawk"
brew "gh"
brew "git"
brew "grc"
brew "ls-lint"
brew "mas"
brew "n"
brew "python@3.9"
brew "squirrel"
brew "stow"
brew "wget"
brew "yadm"
brew "zsh"
cask "appcleaner"
cask "cheatsheet"
cask "coconutbattery"
cask "discord"
cask "dozer"
cask "easydict"
cask "font-chiayi-city"
cask "font-genryumin"
cask "font-gensekigothic"
cask "font-gensenrounded"
cask "font-genwanmin"
cask "font-genyogothic"
cask "font-genyomin"
cask "font-jf-open-huninn"
cask "font-kosugi-maru"
cask "font-league-gothic"
cask "font-meslo-lg-nerd-font"
cask "font-noto-emoji"
cask "font-noto-sans-cjk-tc"
cask "font-noto-serif-cjk"
cask "github"
cask "heptabase"
cask "iconchanger"
cask "imazing"
cask "iterm2"
cask "itsycal"
cask "latest"
cask "logseq"
cask "macgpt"
cask "miniconda"
cask "obsidian"
cask "onyx"
cask "r"
cask "raycast"
cask "rocket"
cask "rstudio"
cask "squirrel"
cask "surge"
cask "telegram"
cask "tomatobar"
cask "visual-studio-code"
cask "zerotier-one"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "File Icons for GitHub and GitLab", id: 1631366167
mas "flomo", id: 1665341561
mas "G App Launcher", id: 1543803459
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "Keyword Search", id: 1558453954
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "Pages", id: 409201541
mas "Save to Reader", id: 1640236961
mas "Stay", id: 1591620171
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "uBlacklist for Safari", id: 1547912640
mas "Whisper", id: 1668083311
vscode "be5invis.toml"
vscode "bierner.markdown-preview-github-styles"
vscode "chrmarti.regex"
vscode "cipchk.zh-hans-tt-hant-vscode"
vscode "DotJoshJohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.codespaces"
vscode "johnpapa.vscode-peacock"
vscode "mhutchie.git-graph"
vscode "MS-CEINTL.vscode-language-pack-zh-hant"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.js-debug-nightly"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "spywhere.guides"
vscode "streetsidesoftware.code-spell-checker"
vscode "Toxblh.polacode-fork"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
