tap "homebrew/bundle"
tap "mac-cleanup/mac-cleanup-py"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Distributed revision control system
brew "git"
# Platform built on V8 to build network applications
brew "node"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# UNIX shell (command interpreter)
brew "zsh"
# Python cleanup script for macOS
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Information browser
cask "follow"
cask "font-fira-code-nerd-font"
cask "font-meslo-for-powerlevel10k"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Network toolbox
cask "surge"
# Open-source code editor
cask "visual-studio-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ritwickdey.liveserver"
vscode "zeabur.zeabur-vscode"
